{
  "appTitle": "ผู้ช่วยแพทย์ AI ของคุณ",
  "appSubtitle": "พูดหรือพิมพ์คำถามทางการแพทย์ และอัปโหลดบันทึกที่เกี่ยวข้องเพื่อรับความช่วยเหลือที่เหมาะสมกับคุณมากขึ้น",
  "uploadMedicalRecords": "อัปโหลดประวัติการรักษา",
  "upload": {
    "description": "ทางเลือก: อัปโหลดประวัติการรักษา รูปภาพ หรือการบันทึกเสียงเพื่อรับความช่วยเหลือที่เข้าใจบริบทมากขึ้น",
    "dragDropText": "ลากและวางไฟล์ที่นี่ หรือคลิกเพื่อเลือก",
    "supportedFormats": "รองรับไฟล์เสียง (MP3, WAV), วิดีโอ (MP4) และรูปภาพ (PNG, JPG)"
  },
  "chat": {
    "welcomeMessage": "สวัสดีค่ะ! ฉันคือผู้ช่วยแพทย์ AI ของคุณ คุณสามารถพิมพ์คำถามหรือใช้ปุ่มไมโครโฟนเพื่อพูดได้ วันนี้ฉันจะช่วยคุณอย่างไรดีคะ?",
    "inputPlaceholder": "พิมพ์ข้อความของคุณ หรือคลิกที่ไมโครโฟนเพื่อพูด...",
    "recordingStarted": "เริ่มการบันทึก... กรุณาพูดได้เลยค่ะ",
    "recordingStopped": "หยุดการบันทึกแล้ว กำลังประมวลผล...",
    "microphoneError": "ไม่สามารถเข้าถึงไมโครโฟนได้ กรุณาตรวจสอบการอนุญาต",
    "processingError": "การประมวลผลเสียงล้มเหลว กรุณาลองพิมพ์แทน",
    "voiceInputError": "การประมวลผลเสียงล้มเหลว"
  },
  "about": {
    "title": "เกี่ยวกับ MedAI",
    "description": "MedAI คือผู้ช่วยแพทย์ AI ฟรีที่ออกแบบมาเพื่อให้การดูแลสุขภาพเข้าถึงได้ง่ายสำหรับทุกคน โดยเฉพาะผู้ที่อยู่ในพื้นที่ห่างไกลที่มีข้อจำกัดในการเข้าถึงบริการทางการแพทย์",
    "mission": {
      "title": "พันธกิจของเรา",
      "content": "เราเชื่อว่าทุกคนควรได้รับคำแนะนำด้านการแพทย์ที่มีคุณภาพ แพลตฟอร์ม AI ของเราช่วยลดช่องว่างโดยให้ข้อมูลเชิงลึกและคำแนะนำทางการแพทย์เบื้องต้น จากการบันทึกเสียง ภาพถ่าย และประวัติการรักษาของคุณ"
    },
    "howItWorks": {
      "title": "วิธีการทำงาน",
      "items": [
        "อัปโหลดการบันทึกเสียงเกี่ยวกับอาการหรือความกังวลทางการแพทย์ของคุณ",
        "แชร์ภาพถ่ายของอาการที่มองเห็นได้หรือประวัติการรักษา",
        "รับข้อมูลเชิงลึกและคำแนะนำทางการแพทย์ที่สร้างโดย AI",
        "รับผลลัพธ์ในหลายภาษา (เร็วๆ นี้)"
      ]
    },
    "notice": {
      "title": "ประกาศสำคัญ",
      "content": "MedAI ออกแบบมาเพื่อให้คำแนะนำเบื้องต้นและไม่ควรใช้แทนคำแนะนำทางการแพทย์จากผู้เชี่ยวชาญ กรุณาปรึกษาผู้ให้บริการด้านสุขภาพที่มีคุณสมบัติเหมาะสมสำหรับการวินิจฉัยและการรักษาที่ถูกต้อง"
    },
    "privacy": {
      "title": "ความเป็นส่วนตัวและความปลอดภัย",
      "content": "เราให้ความสำคัญกับความเป็นส่วนตัวของคุณอย่างจริงจัง ไฟล์ที่อัปโหลดและข้อมูลทางการแพทย์ทั้งหมดได้รับการประมวลผลอย่างปลอดภัยและไม่ถูกจัดเก็บถาวรบนเซิร์ฟเวอร์ของเรา บริการของเราปฏิบัติตามมาตรฐานการป้องกันข้อมูลทางการแพทย์อย่างเคร่งครัด"
    }
  }
} 